Soundwave0245/stm32-ball-balancing-control-On-a-Moving-Vehicle-/电赛小车部分 -缓速启动，按键控制启动 - 缓速停止 - 启动保护/System/PWM.c
#include "stm32f10x.h"                  // Device header

void PWM_Init()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	TIM_TimeBaseInitTypeDef GPIO_TimeBaseInitStructure;
	GPIO_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	GPIO_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	GPIO_TimeBaseInitStructure.TIM_Period = 100-1;                                             //ARR
	GPIO_TimeBaseInitStructure.TIM_Prescaler = 36-1;                                          //PSC
	GPIO_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2,&GPIO_TimeBaseInitStructure);
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;                                                         //CCR3
	TIM_OC3Init(TIM2,&TIM_OCInitStructure);
	
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;                                                         //CCR2
	TIM_OC2Init(TIM2,&TIM_OCInitStructure);
	
	TIM_Cmd(TIM2,ENABLE);
}

void PWM2_SetCompare3(uint16_t Compare3)
{
	TIM_SetCompare3(TIM2,Compare3);
}

void PWM2_SetCompare2(uint16_t Compare2)
{
	TIM_SetCompare2(TIM2,Compare2);
}

//44minutes used

